Revit 2024 API
IFCData.CreateLogical Method
 Creates a logical data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static IFCData CreateLogical(
	IFCLogical value
)
Visual Basic
Public Shared Function CreateLogical ( _
	value As IFCLogical _
) As IFCData
Visual C++
public:
static IFCData^ CreateLogical(
	IFCLogical value
)
Parameters
value
Type: Autodesk.Revit.DB.IFC.IFCLogical
 The IFCLogical value.
Return Value
 The IFCData object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace